现在我想增加一个 积分抽奖 的页面，抽奖页面的设计详情如下，给我具体实现的代码:
1.设计的时候需要考虑到用户可以随时跳转到这个页面，因为用户在其它页面浏览的时候，我想有时候会弹出 他是幸运用户，可以去抽奖的提示，用户点击提示就可以跳转到抽奖页面。这个弹窗页面需要足够吸引人，提供关闭按钮，按钮最好有动画效果。同时有倒计时效果，增加紧迫感。倒计时结束会自动跳转。
2.抽奖页面的详细要求如下:
  1.抽奖采用大转盘的形式，转盘设计的要求如下:
    1.转盘上有可定义的奖品数量，每个扇形会有奖品的描述和相应的图标。扇形背景的颜色也需要可定义，这样的话可以通过背景来体现不同的奖品等级（白色:普通 蓝色:稀有 紫色:史诗 橙色:传说）当然这个对应颜色也可以不用我提供的，你可以自己分析使用更加合理的颜色，甚至对传说级别的奖品还可以进行动画效果突出。
    2.扇形的比列也要可定义，但是抽中哪个奖品由我来决定，转盘只用显示出相应的动画就行。所以运行逻辑是:用户抽奖时，我会生成本次抽奖的结果，然后转盘开始转动，转动到相应的奖品位置，然后停止，显示出抽中的奖品。
    3.转盘抽到史诗 或者 传说奖品的时候，弹出中奖信息时，需要有特效，比如闪烁，或者背景变化等，突出中奖的稀有，甚至你可以增加文字描述，比如:你真是太幸运了，只有0.12%的用户才能抽到这个奖品。
    4.转盘转动的时候，需要有音效，转动结束的时候，需要有结束音效。
    5.抽奖页面上还需要有一个抽奖按钮，点击抽奖按钮，转盘开始转动，然后停止，显示出抽中的奖品。抽奖按钮的样式需要足够吸引人，比如有动画效果，或者有光效等。
    6.转盘的抽奖触发除了用户点击抽奖按钮之外，我还希望可以通过用户滑动屏幕来触发，比如用户在转盘上滑动，转盘就开始转动，然后停止，显示出抽中的奖品。而且转盘的转动速度也要和用户的滑动速度有关，滑动速度越快，转动速度越快。整体动画是先加速，然后匀速，最后减速。用户滑动方式抽奖时，一定要做好反馈，要让用户感觉到自己在控制抽奖的过程。
    7.我还希望用户在抽到普通奖品时要做成和大奖擦肩而过的效果，比如转盘停下来的时候，普通奖品和大奖品之间有一个很小的间隙，然后转盘再次转动，最后停在普通奖品上，这样用户会有一种差一点就中奖的感觉，增加用户的期待感。当用户抽中大奖时也需要做成很不容易抽中的效果，比如转盘停下来的时候，大奖品和普通奖品之间有一个很小的间隙，然后转盘再次转动，最后停在大奖品上，这样用户会有一种差一点就没中奖的感觉，增加用户的惊喜感。
  2.抽奖页面上还需要有一个抽奖记录的功能，用户可以查看自己的抽奖记录，记录里面需要显示出用户抽奖的时间，抽中的奖品，抽奖的方式（用户点击抽奖按钮还是滑动抽奖），抽奖的结果（中奖还是未中奖）。
  3.抽奖页面上还需要有一个抽奖规则的功能，用户可以查看抽奖的规则，规则里面需要显示出抽奖的时间，抽中的奖品，抽奖的方式（用户点击抽奖按钮还是滑动抽奖），抽奖的结果（中奖还是未中奖）。
  4.抽奖页面上还需要有一个抽奖次数的功能，而且累计不同的抽奖次数就可以开宝箱，这里的显示效果可以像能量条的形式，比如用户每抽一次奖，能量条就增加一点，当能量条满了之后，宝箱会变颜色并且跳动(吸引用户点击)，用户就可以开宝箱，当点击宝箱后，宝箱需要有开启的动画效果，然后显示出宝箱里面的奖品。宝箱奖励分别在5，10，20次有宝箱奖励。
  5.抽奖页面还需要一个类似广播的功能，就是会虚假的显示出一些用户抽中了什么奖品，比如:用户A抽中了传说级别的奖品，用户B抽中了史诗级别的奖品，用户C抽中了稀有级别的奖品等，这样可以增加用户的抽奖欲望，让用户觉得抽奖的机会很大，从而增加用户的抽奖次数。而且我希望广播的速度是可以调节的，比如可以设置广播的速度，比如每隔多少秒显示一次广播。这样可以根据用户的心理状态来调节广播的速度，比如用户刚进入抽奖页面的时候，广播速度可以设置的快一点，让用户感觉到抽奖的机会很大，从而增加用户的抽奖次数，当用户抽奖次数多了之后，广播速度可以设置的慢一点，让用户感觉到抽奖的机会很小，从而增加用户的抽奖欲望。
  6.逐步增加中奖率的机制:虚拟的“临近中奖”提示：用户每次抽奖后，系统可以展示一个“离中奖越来越近”的提示，比如：显示“再抽几次，你的中奖机会将大大提升！” 这会给用户制造一种即将中奖的期待感。动态调整中奖几率：根据用户的连续抽奖次数，逐步增加中奖概率（但要让用户感觉是随机的）。例如，前5次中奖率为1%，6-10次为3%，然后不断上升，但保持中奖的随机性，避免用户察觉出固定模式。
  7.碎片化奖励体系：积分兑换奖品碎片：在每次抽奖时，除了主奖品外，提供“奖品碎片”作为 consolation prizes。比如，如果用户抽中了“奖品碎片”，只要集齐一定数量的碎片就可以兑换一个实物奖品或虚拟奖励。这能让用户觉得每次抽奖都不会空手而归。连锁奖励机制：让用户在抽奖后即使没有获得大奖，也能积累某种奖励。比如，抽奖10次就获得一个小礼物或额外的抽奖机会，激发用户持续进行抽奖。
  8.适时的挫折感:偶尔的小挫折：经过几次抽奖后，如果用户没有获得大奖，适时给予一些小的挫败感提示，例如显示“真遗憾，差一点就中了！” 这会让用户觉得自己非常接近中奖，从而继续投入积分进行抽奖。阶梯式大奖设置：设计不同档次的奖励，让用户即使得不到最高级的大奖，也可以得到中级或低级的奖励，从而避免用户感到完全的失望。
  9.可以根据用户的当前积分来提供不同的转盘，比如有消耗1积分的转盘，有消耗10积分的转盘，有消耗100积分的转盘等，不同的转盘奖品不同，消耗的积分越多，奖品越丰富，中奖几率也越大。引导用户能够消耗积分。
  10.抽奖时还可以弹出积分消耗对战的功能，对战方是系统虚拟的，规则是在一定时间内，谁的积分消耗的多，谁就可以获得对战奖励，对战奖励当前设置为100积分。对战的结果会在抽奖记录里面显示出来。并且虚拟对战方要采用合适的策略，既要让用户感觉到自己有机会赢，又不能让用户轻易赢得对战奖励，这样可以增加用户的积极性，让用户更加投入到抽奖中。对战双方会有一个pk的能量条，两方分别有共用一个能量条，左边为用户，右边为虚拟对战方，每个用户有相应的占比，整体加起来是一整条，并且颜色需要区分，比如用户的颜色是蓝色，虚拟对战方的颜色是红色。连接处有个vs的图标，能量条上还有相应的分数。
  11.每次抽奖会累计相应的幸运值，并且在合适的地方显示当前幸运值。
3.整体的设计原则就是要让用户持续使用积分的抽奖页面，我们需要结合心理学原理和游戏机制，使用户感觉即将中奖并获得满足感，如果你觉得我的设计有些地方不够符合设计原则的话，你可以采用更好的方式。注意页面需要高级感，请仔细思考之后再给出相应的代码。